{
  "etips.tip.new_hud": "Don't like the new HUD? Go back to the original one by pausing, clicking on RPG-HUD on the top right, going to General Settings, and changing the HUD type to another option.3",
  "etips.tip.combat_roll": "You can use a combat roll (default: R) to quickly evade damage.",
  "etips.tip.rei": "There are many new items! Search through them with the REI mod on the right side of the inventory screen. Press R on an item to see its recipe, or press U on an item (including in your inventory) to see its uses.",
  "etips.tip.flintlocks": "Craft flintlock weapons with iron materials for a ranged weapon that has higher velocity than bows.",
  "etips.tip.new_anvil": "Anvils are better now! Name changes are free, repair penalties rack up slower, and the maximum enchantment limit is now 64 levels.",
  "etips.tip.grave": "A grave spawns when you die. Go to it to retrieve your items.",
  "etips.tip.cycle_trades": "You no longer need to break and replace a workstation to reroll trades. Villagers that have not been traded with yet can have their trades rerolled with the new \"Cycle Trades button.\"",
  "etips.tip.furniture": "Interior decoration is now easier with the addition of many various furniture items.",
  "etips.tip.waystones": "Waystones can spawn at villages. They allow for fast travel between other waystones. They can be crafted as well.",
  "etips.tip.more_professions": "There are more villager professions now, like the miner, the hunter, and the gardener.",
  "etips.tip.unique_loot": "Tired of people taking all the chest loot? All chest loot is now unique to each player! Chests you have not yet opened have a golden outline on them.",
  "etips.tip.new_eyes": "To get to the End, you now need to find twelve unique Eyes around the world.",
  "etips.tip.old_eye": "The Old Eye can be found in desert pyramids.",
  "etips.tip.nether_eye": "The Nether Eye can be found in Nether Fortresses.",
  "etips.tip.cold_eye": "The Cold Eye can be found in igloos.",
  "etips.tip.rogue_eye": "The Rogue Eye can be found in jungle pyramids.",
  "etips.tip.black_eye": "The Black Eye can be found in buried treasure chests.",
  "etips.tip.magical_eye": "The Magical Eye can be found by defeating Evokers.",
  "etips.tip.lost_eye": "The Lost Eye can be found in abandoned mineshafts.",
  "etips.tip.corrupted_eye": "The Corrupted eye can be found in Pillager outposts.",
  "etips.tip.wither_eye": "The Wither Eye can be found by defeating the Wither.",
  "etips.tip.guardian_eye": "The Guardian Eye can be found by defeating an Elder Guardian.",
  "etips.tip.witch_eye": "The Witch Eye is crafted from an Eye of Ender and the Witch Pupil, which can drop from Witches.",
  "etips.tip.cursed_eye": "The Cursed Eye is found in Treasure Bastions.",
  "etips.tip.exotic_eye": "The Exotic Eye is crafted from an Eye of Ender, two Conduits, two glowing inc sacs, and four different colors of coral.",
  "etips.tip.evil_eye": "The Evil Eye can be purchased from a master-level Cleric Villager.",
  "etips.tip.undead_eye": "The Undead Eye can be crafted from a ghast tear, rotten flesh, a bone, phantom membrane, and an undead soul, which drops from Skeleton Horses.",
  "etips.tip.cryptic_eye": "Nobody knows how to find the Cryptic Eye. Rumors say it has something to do with enchanting...",
  "etips.tip.eye_of_ender": "The Eye of Ender cannot be used. It is now just a crafting material. You must remove them from an End Portal and replace it with a new Eye to access the End.",
  "etips.tip.end_pyramid": "Mysterious pyramids sometimes spawn above End Cities. I wonder what's up there...?",
  "etips.tip.elytra_chestplate": "You can equip an elytra and a chestplate at the same time. No compromises!",
  "etips.tip.best_armor": "Metallurgium gear has the highest stats. However, other pieces of gear have bonus effects, like Celestium's speed or Carmot's Fortune and Looting.",
  "etips.tip.crystalite_armor": "Craft a set of Crystalite armor for bonus health regeneration.",
  "etips.tip.alloy_forge": "Craft an alloy forge to create metal alloys for powerful gear.",
  "etips.tip.better_forges": "Higher level forges can smelt more and better alloys.",
  "etips.tip.guard_villagers": "You can access the inventory of Guard villagers if you have Hero of the Village.",
  "etips.tip.infusion_pedestal": "An Infusion Pedestal allows you to perform rituals to get enchanted books and other items.",
  "etips.tip.eternal_portal": "Activate an Eternal Portal in the end to generate a portal in the overworld that allows travel between those locations.",
  "etips.tip.nether_ruby_pickaxe": "Nether Ruby pickaxes automatically smelt ores and mine obsidian faster.",
  "etips.tip.double_chest": "You can make double chests in any orientation.",
  "etips.tip.larger_chest": "Craft larger chests out of iron, gold, diamond, obsidian, and netherite.",
  "etips.tip.advancements": "Check out the Advancements page to see how you can progress through various mods.",
  "etips.tip.pots_skillets": "Use pots and skillets to make better food items.",
  "etips.tip.new_veggies": "Farm some new vegetables to make heartier dishes.",
  "etips.tip.netherite": "Netherite is no longer the best gear! Upgrade your netherite gear to metallurgium gear for the best stats, or check out other armor sets that have bonus effects!",
  "etips.tip.dungeons": "Be alert for new dungeons and other buildings in any dimension.",
  "etips.tip.inventory_movement": "You can now move while in your inventory or other menus!",
  "etips.tip.veinmine": "Crouch while mining to mine 16 blocks at once. The Vein Mining enchantment for tools increases this by 16 more per level, to a maximum of 96 blocks with Vein Mining V.",
  "etips.tip.config": "All mods are pre-configured for the intended experience. However, you can customize some mods further in the Mods section on the pause menu.",
  "etips.tip.tables": "Items will now remain on crafting tables, anvils, and enchanting tables unless removed. Items in these workbench inventories will show up on top of the block as well.",
  "etips.tip.doors": "Adjacent doors, horizontally lined up trapdoors, and vertically stacked gates all open and close at the same time when interacting with them.",
  "etips.tip.armor": "Player armor is invisible now so you can see player skins. However, armor becomes visible again during combat. Press K to configure this.",
  "etips.tip.weapon_master": "All gear in your hotbar is displayed on your character. Press V to configure this.",
  "etips.tip.boat": "Craft larger sailboats, cogs and briggs, for improved water transportation. They even have storage and you can mount cannons on them. Deploy the sails to increase speed (Default: E).",
  "etips.tip.carriage": "Attach a carriage to a horse or donkey with a linker to carry items or more players.",
  "etips.tip.soulbound": "The Soulbound enchantment makes the item remain in your inventory, even through death.",
  "etips.tip.trident_enchant": "Trident enchanting is now improved! Sharpness, Fire Aspect, Looting, and more can be enchanted onto a trident. Loyalty works even if you throw your trident into the void and it brings mob drops towards you on its return.",
  "etips.tip.axes": "Axes can now get sharpness from a table. They can also receive Fire ASpect, Looting, Knockback, and Sweeping Edge.",
  "etips.tip.crossbow": "Crossbows can now be enchanted with Flame, Power, Punch, Infinity, and Looting. Bows can also receive Piercing, Multishot, Quick Charge, and Looting.",
  "etips.tip.horse_armor": "Horse armor can now be enchanted with chestarmorplate enchantments like Protection,Feather Falling, and Thorns.",
  "etips.tip.sharpness_smite": "Weapons can have Sharpness and Smite on them at the same time.",
  "etips.tip.painting": "When crafting a painting, use a dye instead of a wool block. It makes a much cooler kind of painting!",
  "etips.tip.wormhole": "A pocket wormhole can be used to teleport to any Waystone.",
  "etips.tip.twilight_forest": "Create a portal to the Twilight Forest with dirt, flowers, water, and a diamond. Beware its many structures and bosses, that guard its valuable loot!",
  "etips.tip.distant_horizons": "The Distant Horizons mod is on by default and allows for large render distances with very little impact on performance! However, it is incompatible with shaders.",
  "etips.tip.shaders": "Shaders significantly improve visuals. Enable them from the video options. However, it is very demanding on your GPU and is incompatible with Distant Horizons.",
  "etips.tip.quickselect": "Quick select an item in your inventory related to your currently held item with \"E\" by default."
}